{"format": "layers-model", "generatedBy": null, "convertedBy": "TensorFlow.js Converter v1.7.4r1", "modelTopology": null, "weightsManifest": [{"paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"], "weights": [{"name": "conv1d/kernel", "shape": [8, 1, 256], "dtype": "float32"}, {"name": "conv1d/bias", "shape": [256], "dtype": "float32"}, {"name": "conv1d_1/kernel", "shape": [8, 256, 256], "dtype": "float32"}, {"name": "conv1d_1/bias", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv1d_2/kernel", "shape": [8, 256, 128], "dtype": "float32"}, {"name": "conv1d_2/bias", "shape": [128], "dtype": "float32"}, {"name": "conv1d_3/kernel", "shape": [8, 128, 128], "dtype": "float32"}, {"name": "conv1d_3/bias", "shape": [128], "dtype": "float32"}, {"name": "conv1d_4/kernel", "shape": [8, 128, 128], "dtype": "float32"}, {"name": "conv1d_4/bias", "shape": [128], "dtype": "float32"}, {"name": "conv1d_5/kernel", "shape": [8, 128, 128], "dtype": "float32"}, {"name": "conv1d_5/bias", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_1/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_1/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_1/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_1/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv1d_6/kernel", "shape": [8, 128, 64], "dtype": "float32"}, {"name": "conv1d_6/bias", "shape": [64], "dtype": "float32"}, {"name": "conv1d_7/kernel", "shape": [8, 64, 64], "dtype": "float32"}, {"name": "conv1d_7/bias", "shape": [64], "dtype": "float32"}, {"name": "dense/kernel", "shape": [256, 8], "dtype": "float32"}, {"name": "dense/bias", "shape": [8], "dtype": "float32"}]}]}